app/Controllers/HotelController.php

SELECT *
FROM `hotel`
WHERE `hotel`.`id` = '1'
SELECT *
FROM `room_category`
---
    public function hotalDetails($id){
         $data['cities'] = $this->citiesModel->Getcity();
        $data['pages'] = $this->uttarakhandModel->GetAllPlaces();
        $data['random_city'] = $this->citiesModel->get_random_cities();
        $data['recentBlogs'] = $this->blogModel->getRecentBlogs(3);

        $data['seo']=[
            'meta_title'=>'home',
            'meta_description'=>'home',
            'meta_keywords'=>'home'
        ];

        $data['hotalDetails'] = $this->hotelModel->find($id);
        $data['room_category'] = $this->roomsCategoryModel->findAll();

SELECT `b`.*, `bi`.`persons`, `bi`.`duration`, `bi`.`room_id`
FROM `booking` `b`
JOIN `booking_item` `bi` ON `bi`.`booking_id` = `b`.`id`
WHERE `b`.`id` = '9'
---
    public function checkoutBooking($id){

   $data['cities'] = $this->citiesModel->Getcity();
        $data['pages'] = $this->uttarakhandModel->GetAllPlaces();
        $data['random_city'] = $this->citiesModel->get_random_cities();
        $data['recentBlogs'] = $this->blogModel->getRecentBlogs(3);

        $data['seo']=[
            'meta_title'=>'home',
            'meta_description'=>'home',
            'meta_keywords'=>'home'
        ];

        $builder = $this->db->table('booking b');
        $builder->select('b.*, bi.persons, bi.duration, bi.room_id');
        $builder->join('booking_item bi', 'bi.booking_id = b.id');
        $builder->where('b.id', $id);
        $data['$booking_data'] = $builder->get()->getResultArray();