app/Controllers/ImagesController.php

INSERT INTO `images` (`category`, `city_place_id`, `image`)
VALUES ('place',NULL,'nainital-5450026.webp'), ('place',NULL,'nainital.webp'), ('place',NULL,'haridwar3.webp'), ('place',NULL,'haridwar2.webp')
---
    public function InsertimageData() {


        if (!empty($_FILES)) {
            $targetDir = "uploads/";
            $fileNames = [];
        }
        $option = $this->request->getVar('option');
        $city_page_id = $option === 'city' ? $this->request->getVar('city_id') : $this->request->getVar('place_id');
        foreach ($_FILES['file']['name'] as $key => $name) {
            $targetFile = $targetDir . basename($name);
            if (move_uploaded_file($_FILES['file']['tmp_name'][$key], $targetFile)) {
                $fileNames[] = $name;
            }
            $data[] = [
                'category' => $option,
                'city_place_id' => $city_page_id,
                'image' => $name
            ];
        }

        if ($this->imageModel->insertBatch($data)) {