app/Models/BlogModel.php

    public function GetAllBlog(){

      return $this->db->table($this->table)
      ->get()->getResultArray();
---
SELECT *
FROM `blogs`