app/Models/BlogModel.php

  public function GetAllBlog()
  {
      return $this->db->table($this->table)
          ->select('blogs.*, COUNT(DISTINCT user_comments.id) as comment_count, COUNT(DISTINCT blog_likes.id) as like_count')
          ->join('user_comments', 'user_comments.blog_id = blogs.id', 'left')
          ->join('blog_likes', 'blog_likes.blog_id = blogs.id', 'left')
          ->groupBy('blogs.id')
          ->get()
          ->getResultArray();
---
SELECT `blogs`.*, COUNT(DISTINCT user_comments.id) as comment_count, COUNT(DISTINCT blog_likes.id) as like_count
FROM `blogs`
LEFT JOIN `user_comments` ON `user_comments`.`blog_id` = `blogs`.`id`
LEFT JOIN `blog_likes` ON `blog_likes`.`blog_id` = `blogs`.`id`
GROUP BY `blogs`.`id`

  public function getRecentBlogs($limit)
  {
    return $this->db->table('blogs')
      ->select('*')
      ->orderBy('created_at', 'DESC')
      ->limit($limit)
      ->get()
      ->getResultArray();
---
SELECT *
FROM `blogs`
ORDER BY `created_at` DESC
 LIMIT 3