app/Models/CitiesModel.php

    public function Getcity(){
      return $this->db->table($this->table)
      ->get()
      ->getResultArray();
---
SELECT *
FROM `cities`

    public function GetcityBYslug($slug){

      return $this->db->table($this->table)
      ->where('city_name',$slug)
      ->get()
      ->getRowArray();
---
SELECT *
FROM `cities`
WHERE `city_name` = 'Almora'

  public function get_random_cities() {
    $query= $this->db->table('cities')
                     ->select('cities.id,cities.city_name,cities.meta_title')
                     ->get()
                     ->getResultArray();

                    $arr=[];

     foreach($query as $data):
        $img=$this->db->table('images')
        ->select('image')
        ->where('category','city')
        ->where('city_place_id',$data['id'])
        ->orderBy('RAND()')
        ->get()
        ->getRowArray();
---
SELECT `cities`.`id`, `cities`.`city_name`, `cities`.`meta_title`
FROM `cities`
SELECT `image`
FROM `images`
WHERE `category` = 'city'
AND `city_place_id` = '1'
ORDER BY RAND()