app/Models/FoodModel.php

  public function GetimagebyFood($category, $id){
    $imagesArr = [];
    $foodImages = $this->db->table($this->table)
      ->select('*')
      ->where('category', $category)
      ->where('city_place_id', $id)
      ->orderBy('top_foods')
      ->get()
      ->getResultArray();
---
SELECT *
FROM `foods`
WHERE `category` = 'city'
AND `city_place_id` = '1'
ORDER BY `top_foods`