app/Models/ImageModel.php

  public function GetImagesbyid($category, $id){
    return $this->db->table($this->table)
      ->where('category', $category)
      ->where('city_place_id', $id)
      ->get()
      ->getResultArray();
---
SELECT *
FROM `images`
WHERE `category` = 'city'
AND `city_place_id` = '1'

  public function get_photos_pages_list(){
    $city_data = $this->db->table($this->table)
      ->select('images.*,cities.city_name as title')
      ->join('cities', 'cities.id = images.city_place_id')
      ->where('images.category', 'city')
      ->get()
      ->getResultArray();

    $place_data = $this->db->table($this->table)
      ->select('images.*,explore_uttarakhand.id as place_id,explore_uttarakhand.title')
      ->join('explore_uttarakhand', 'explore_uttarakhand.id = images.city_place_id', 'left')
      ->where('images.category', 'place')
      ->get()
      ->getResultArray();
---
SELECT `images`.*, `cities`.`city_name` as `title`
FROM `images`
JOIN `cities` ON `cities`.`id` = `images`.`city_place_id`
WHERE `images`.`category` = 'city'
SELECT `images`.*, `explore_uttarakhand`.`id` as `place_id`, `explore_uttarakhand`.`title`
FROM `images`
LEFT JOIN `explore_uttarakhand` ON `explore_uttarakhand`.`id` = `images`.`city_place_id`
WHERE `images`.`category` = 'place'

  public function get_image_byid($id){
    return $this->db->table($this->table)
    ->where('id', $id)
    ->get()
    ->getRowArray();
---
SELECT *
FROM `images`
WHERE `id` = '1'