app/Models/UttarakhandModel.php

  public function GetDataByPlaceCity($id) {
    return $this->db->table($this->table)
      ->select('explore_uttarakhand.*,images.image,cities.city_name')
      ->join('images', 'explore_uttarakhand.id = images.city_place_id')
      ->join('cities', 'explore_uttarakhand.city_id = cities.id')
      ->where('explore_uttarakhand.city_id', $id)
      ->groupBy('explore_uttarakhand.place')
      ->get()
      ->getResultArray();
---
SELECT `explore_uttarakhand`.*, `images`.`image`, `cities`.`city_name`
FROM `explore_uttarakhand`
JOIN `images` ON `explore_uttarakhand`.`id` = `images`.`city_place_id`
JOIN `cities` ON `explore_uttarakhand`.`city_id` = `cities`.`id`
WHERE `explore_uttarakhand`.`city_id` = '1'
GROUP BY `explore_uttarakhand`.`place`

  public function get_all_places(){
    return $this->db->table($this->table)
    ->select('explore_uttarakhand.*, images.image, cities.city_name')
    ->join('images', 'explore_uttarakhand.id = images.city_place_id', 'left')
    ->join('cities', 'explore_uttarakhand.city_id = cities.id')
    ->get()
    ->getResultArray();
---
SELECT `explore_uttarakhand`.*, `images`.`image`, `cities`.`city_name`
FROM `explore_uttarakhand`
LEFT JOIN `images` ON `explore_uttarakhand`.`id` = `images`.`city_place_id`
JOIN `cities` ON `explore_uttarakhand`.`city_id` = `cities`.`id`